In [2]:
import pandas as pd

In [3]:
yam_price = pd.read_csv('Yam-price.csv', index_col=0)

In [4]:
month_array = {
    'JANUARY':1,
    'FEBRUARY':2,
    'MARCH':3,
    'APRIL':4,
    'MAY':5,
    'JUNE':6,
    'JULY':7,
    'AUGUST':8,
    'SEPTEMBER':9,
    'OCTOBER':10,
    'NOVEMBER':11,
    'DECEMBER':12
}

In [5]:
yam_price.head()

   Year    MONTH   PRICE
0  1970  JANUARY  0.0032
1  1971  JANUARY  0.0037
2  1972  JANUARY  0.0038
3  1973  JANUARY  0.0045
4  1974  JANUARY  0.0068

In [6]:
yam_price.tail()

     Year     MONTH   PRICE
571  2013  DECEMBER  249.30
572  2014  DECEMBER  268.00
573  2015  DECEMBER  345.17
574  2016  DECEMBER  424.69
575  2017  DECEMBER  461.76

In [7]:
yam_price['DAY'] = 1

In [8]:
yam_price.head()

   Year    MONTH   PRICE  DAY
0  1970  JANUARY  0.0032    1
1  1971  JANUARY  0.0037    1
2  1972  JANUARY  0.0038    1
3  1973  JANUARY  0.0045    1
4  1974  JANUARY  0.0068    1

In [9]:
yam_price['MONTH'] = yam_price.MONTH.map(month_array)

In [10]:
yam_price.head()

   Year  MONTH   PRICE  DAY
0  1970      1  0.0032    1
1  1971      1  0.0037    1
2  1972      1  0.0038    1
3  1973      1  0.0045    1
4  1974      1  0.0068    1

In [11]:
yam_price.tail()

     Year  MONTH   PRICE  DAY
571  2013     12  249.30    1
572  2014     12  268.00    1
573  2015     12  345.17    1
574  2016     12  424.69    1
575  2017     12  461.76    1

In [12]:
year = yam_price['Year']

In [13]:
year.head()

0    1970
1    1971
2    1972
3    1973
4    1974
Name: Year, dtype: int64

In [14]:
month = yam_price['MONTH']

In [15]:
month.head()

0    1
1    1
2    1
3    1
4    1
Name: MONTH, dtype: int64

In [16]:
year_1970 = yam_price.loc[yam_price['Year'] == 1970]

In [17]:
year_1970

     Year  MONTH   PRICE  DAY
0    1970      1  0.0032    1
48   1970      2  0.0031    1
96   1970      3  0.0035    1
144  1970      4  0.0037    1
192  1970      5  0.0040    1
240  1970      6  0.0039    1
288  1970      7  0.0036    1
336  1970      8  0.0037    1
384  1970      9  0.0031    1
432  1970     10  0.0030    1
480  1970     11  0.0033    1
528  1970     12  0.0035    1

In [18]:
year_1971 = yam_price.loc[yam_price['Year'] == 1971]

In [19]:
year_1971

     Year  MONTH   PRICE  DAY
1    1971      1  0.0037    1
49   1971      2  0.0039    1
97   1971      3  0.0040    1
145  1971      4  0.0034    1
193  1971      5  0.0051    1
241  1971      6  0.0054    1
289  1971      7  0.0039    1
337  1971      8  0.0034    1
385  1971      9  0.0030    1
433  1971     10  0.0030    1
481  1971     11  0.0034    1
529  1971     12  0.0042    1

In [20]:
ya = pd.concat([year_1970,year_1971])

In [21]:
year_1972 = yam_price.loc[yam_price['Year'] == 1972]

In [22]:
ya = pd.concat([ya,year_1972], sort=True)

In [23]:
year_1973 = yam_price.loc[yam_price['Year'] == 1973]

In [24]:
ya = pd.concat([ya,year_1973], sort=True)

In [25]:
year_1974 = yam_price.loc[yam_price['Year'] == 1974]

In [26]:
ya = pd.concat([ya,year_1974], sort=True)

In [27]:
year_1975 = yam_price.loc[yam_price['Year'] == 1975]

In [28]:
ya = pd.concat([ya,year_1975], sort=True)

In [29]:
year_1976 = yam_price.loc[yam_price['Year'] == 1976]

In [30]:
ya = pd.concat([ya,year_1976], sort=True)

In [31]:
year_1977 = yam_price.loc[yam_price['Year'] == 1977]

In [32]:
ya = pd.concat([ya,year_1977], sort=True)

In [33]:
year_1978 = yam_price.loc[yam_price['Year'] == 1978]

In [34]:
ya = pd.concat([ya,year_1978], sort=True)

In [35]:
year_1979 = yam_price.loc[yam_price['Year'] == 1979]

In [36]:
ya = pd.concat([ya,year_1979], sort=True)

In [37]:
year_1980 = yam_price.loc[yam_price['Year'] == 1980]

In [38]:
ya = pd.concat([ya,year_1980], sort=True)

In [39]:
year_1981 = yam_price.loc[yam_price['Year'] == 1981]

In [40]:
ya = pd.concat([ya,year_1981], sort=True)

In [41]:
year_1982 = yam_price.loc[yam_price['Year'] == 1982]

In [42]:
ya = pd.concat([ya,year_1982], sort=True)

In [43]:
year_1983 = yam_price.loc[yam_price['Year'] == 1983]

In [44]:
ya = pd.concat([ya,year_1983], sort=True)

In [45]:
year_1984 = yam_price.loc[yam_price['Year'] == 1984]

In [46]:
ya = pd.concat([ya,year_1984], sort=True)

In [47]:
year_1985 = yam_price.loc[yam_price['Year'] == 1985]

In [48]:
ya = pd.concat([ya,year_1985], sort=True)

In [49]:
year_1986 = yam_price.loc[yam_price['Year'] == 1986]

In [50]:
ya = pd.concat([ya,year_1986], sort=True)

In [51]:
year_1987 = yam_price.loc[yam_price['Year'] == 1987]

In [52]:
ya = pd.concat([ya,year_1987], sort=True)

In [53]:
year_1988 = yam_price.loc[yam_price['Year'] == 1988]

In [54]:
ya = pd.concat([ya,year_1988], sort=True)

In [55]:
year_1989 = yam_price.loc[yam_price['Year'] == 1989]

In [56]:
ya = pd.concat([ya,year_1989], sort=True)

In [57]:
year_1990 = yam_price.loc[yam_price['Year'] == 1990]

In [58]:
ya = pd.concat([ya,year_1990], sort=True)

In [59]:
year_1991 = yam_price.loc[yam_price['Year'] == 1991]

In [60]:
ya = pd.concat([ya,year_1991], sort=True)

In [61]:
year_1992 = yam_price.loc[yam_price['Year'] == 1992]

In [62]:
ya = pd.concat([ya,year_1992], sort=True)

In [63]:
year_1993 = yam_price.loc[yam_price['Year'] == 1993]

In [64]:
ya = pd.concat([ya,year_1993], sort=True)

In [65]:
year_1994 = yam_price.loc[yam_price['Year'] == 1994]

In [66]:
ya = pd.concat([ya,year_1994], sort=True)

In [67]:
year_1995 = yam_price.loc[yam_price['Year'] == 1995]

In [68]:
ya = pd.concat([ya,year_1995], sort=True)

In [69]:
year_1996 = yam_price.loc[yam_price['Year'] == 1996]

In [70]:
ya = pd.concat([ya,year_1996], sort=True)

In [71]:
year_1997 = yam_price.loc[yam_price['Year'] == 1997]

In [72]:
ya = pd.concat([ya,year_1997], sort=True)

In [73]:
year_1998 = yam_price.loc[yam_price['Year'] == 1998]

In [74]:
ya = pd.concat([ya,year_1998], sort=True)

In [75]:
year_1999 = yam_price.loc[yam_price['Year'] == 1999]

In [76]:
ya = pd.concat([ya,year_1999], sort=True)

In [77]:
year_2000 = yam_price.loc[yam_price['Year'] == 2000]

In [78]:
ya = pd.concat([ya,year_2000], sort=True)

In [79]:
year_2001 = yam_price.loc[yam_price['Year'] == 2001]

In [80]:
ya = pd.concat([ya,year_2001], sort=True)

In [81]:
year_2002 = yam_price.loc[yam_price['Year'] == 2002]

In [82]:
ya = pd.concat([ya,year_2002], sort=True)

In [83]:
year_2003 = yam_price.loc[yam_price['Year'] == 2003]

In [84]:
ya = pd.concat([ya,year_2003], sort=True)

In [85]:
year_2004 = yam_price.loc[yam_price['Year'] == 2004]

In [86]:
ya = pd.concat([ya,year_2004], sort=True)

In [87]:
year_2005 = yam_price.loc[yam_price['Year'] == 2005]

In [88]:
ya = pd.concat([ya,year_2005], sort=True)

In [89]:
year_2006 = yam_price.loc[yam_price['Year'] == 2006]

In [90]:
ya = pd.concat([ya,year_2006], sort=True)

In [91]:
year_2007 = yam_price.loc[yam_price['Year'] == 2007]

In [92]:
ya = pd.concat([ya,year_2007], sort=True)

In [93]:
year_2008 = yam_price.loc[yam_price['Year'] == 2008]

In [94]:
ya = pd.concat([ya,year_2008], sort=True)

In [95]:
year_2009 = yam_price.loc[yam_price['Year'] == 2009]

In [96]:
ya = pd.concat([ya,year_2009], sort=True)

In [97]:
year_2010 = yam_price.loc[yam_price['Year'] == 2010]

In [98]:
ya = pd.concat([ya,year_2010], sort=True)

In [99]:
year_2011 = yam_price.loc[yam_price['Year'] == 2011]

In [100]:
ya = pd.concat([ya,year_2011], sort=True)

In [101]:
year_2012 = yam_price.loc[yam_price['Year'] == 2012]

In [102]:
ya = pd.concat([ya,year_2012], sort=True)

In [103]:
year_2013 = yam_price.loc[yam_price['Year'] == 2013]

In [104]:
ya = pd.concat([ya,year_2013], sort=True)

In [105]:
year_2014 = yam_price.loc[yam_price['Year'] == 2014]

In [106]:
ya = pd.concat([ya,year_2014], sort=True)

In [107]:
year_2015 = yam_price.loc[yam_price['Year'] == 2015]

In [108]:
ya = pd.concat([ya,year_2015], sort=True)

In [109]:
year_2016 = yam_price.loc[yam_price['Year'] == 2016]

In [110]:
ya = pd.concat([ya,year_2016], sort=True)

In [111]:
year_2017 = yam_price.loc[yam_price['Year'] == 2017]

In [112]:
ya = pd.concat([ya,year_2017], sort=True)

In [113]:
ya['DATE'] = pd.to_datetime(ya[['Year', 'MONTH','DAY']])

In [114]:
ya.head()

     DAY  MONTH   PRICE  Year       DATE
0      1      1  0.0032  1970 1970-01-01
48     1      2  0.0031  1970 1970-02-01
96     1      3  0.0035  1970 1970-03-01
144    1      4  0.0037  1970 1970-04-01
192    1      5  0.0040  1970 1970-05-01

In [115]:
ya.tail()

     DAY  MONTH   PRICE  Year       DATE
383    1      8  524.45  2017 2017-08-01
431    1      9  482.71  2017 2017-09-01
479    1     10  447.24  2017 2017-10-01
527    1     11  462.33  2017 2017-11-01
575    1     12  461.76  2017 2017-12-01

In [116]:
ya = ya.to_csv('unclean_price_date.csv')